In [0]:
import pandas as pd
import numpy as np
from numpy import nan as NA

#Chapter 7 - Data Cleaning and Preparation

##Handling Missing data

In [0]:
s1 = pd.Series([1,2,np.nan,4,5,NA])
s1

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
dtype: float64

In [0]:
s1[s1.isnull()]

2   NaN
5   NaN
dtype: float64

In [0]:
s1[~s1.isnull()]

0    1.0
1    2.0
3    4.0
4    5.0
dtype: float64

In [0]:
s1[s1.notnull()]

0    1.0
1    2.0
3    4.0
4    5.0
dtype: float64

In [0]:
s1.notnull()

0     True
1     True
2    False
3     True
4     True
5    False
dtype: bool

In [0]:
s2 = pd.Series([34,23,12,45,np.nan,67,np.nan,89,23,NA])

In [0]:
s2 = s2[s2.notnull()]
#s2.index = [0,1,2,3,4,5,6]
s2.reset_index()

   index     0
0      0  34.0
1      1  23.0
2      2  12.0
3      3  45.0
4      4  67.0
5      5  89.0
6      6  23.0

In [0]:
s2 = pd.Series([34,23,12,45,np.nan,67,np.nan,89,23,NA])
s2.dropna()    #drops all nan values but doesn't update the orignal values
#to update orignal series use inplace attribute
s2.dropna(inplace = True)

In [0]:
s2

0    34.0
1    23.0
2    12.0
3    45.0
5    67.0
7    89.0
8    23.0
dtype: float64

In [0]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [0]:
#thresh means how many values are provided , required count of non NA values
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [0]:
data.dropna(how = 'any')

     0    1    2
0  1.0  6.5  3.0

In [0]:
#every row must have atlest 2 values, else drop
data.dropna(thresh = 2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [0]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.741190       NaN       NaN
1 -1.401321       NaN       NaN
2 -0.125647       NaN -1.782573
3  1.529130       NaN -1.652706
4  0.241959  1.171364 -0.962978
5  1.963007 -0.708615  0.267689
6  0.717876  1.106035 -0.024919

In [0]:
df.fillna(0)

          0         1         2
0 -0.741190  0.000000  0.000000
1 -1.401321  0.000000  0.000000
2 -0.125647  0.000000 -1.782573
3  1.529130  0.000000 -1.652706
4  0.241959  1.171364 -0.962978
5  1.963007 -0.708615  0.267689
6  0.717876  1.106035 -0.024919

In [0]:
df.fillna({1 : 1, 2 : 2})          #{column : value, column : value}

          0         1         2
0 -0.741190  1.000000  2.000000
1 -1.401321  1.000000  2.000000
2 -0.125647  1.000000 -1.782573
3  1.529130  1.000000 -1.652706
4  0.241959  1.171364 -0.962978
5  1.963007 -0.708615  0.267689
6  0.717876  1.106035 -0.024919

In [0]:
df.fillna(df.mean())        #df.mean()  gives a mean for ach column so fillna fills the mean in NAs accordingly

          0         1         2
0 -0.741190  0.522928 -0.831098
1 -1.401321  0.522928 -0.831098
2 -0.125647  0.522928 -1.782573
3  1.529130  0.522928 -1.652706
4  0.241959  1.171364 -0.962978
5  1.963007 -0.708615  0.267689
6  0.717876  1.106035 -0.024919

In [0]:
df.fillna({1 : df[1].mean() , 2 : df[2].mean()})

          0         1         2
0 -0.741190  0.522928 -0.831098
1 -1.401321  0.522928 -0.831098
2 -0.125647  0.522928 -1.782573
3  1.529130  0.522928 -1.652706
4  0.241959  1.171364 -0.962978
5  1.963007 -0.708615  0.267689
6  0.717876  1.106035 -0.024919

##forward fill and backward fill

In [0]:
df.fillna(method = 'bfill')           #you can define fill limit df.fillna(method == 'bfill', limit = 2) limit of 2 means just 2 backward values will be filled

          0         1         2
0 -0.741190  1.171364 -1.782573
1 -1.401321  1.171364 -1.782573
2 -0.125647  1.171364 -1.782573
3  1.529130  1.171364 -1.652706
4  0.241959  1.171364 -0.962978
5  1.963007 -0.708615  0.267689
6  0.717876  1.106035 -0.024919

In [0]:
df.fillna(method = 'ffill')

          0         1         2  (0, 1)  (0, 2)
0 -0.741190       NaN       NaN     0.2     0.3
1  0.200000       NaN       NaN     0.2     0.3
2  0.300000       NaN -1.782573     0.2     0.3
3  1.529130       NaN -1.652706     0.2     0.3
4  0.241959  1.171364 -0.962978     0.2     0.3
5  1.963007 -0.708615  0.267689     0.2     0.3
6  0.717876  1.106035 -0.024919     0.2     0.3

In [0]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [0]:
data.duplicated()                   #no columns defined, all columns analyzed only last row is duplicate

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [0]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [0]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [0]:
data.drop_duplicates(['k1'])     #checks  duplications in column k1

    k1  k2
0  one   1
1  two   1

In [0]:
data.drop_duplicates(['k2'])    #check duplication in col k2 keep = 'first', keep = 'last'

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [0]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
   'Pastrami', 'corned beef', 'Bacon',
   'pastrami', 'honey ham', 'nova lox'],
   'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [0]:
meat_to_animal = {
'bacon': 'cow',
'pulled pork': 'cow',
'pastrami': 'goat',
'corned beef': 'cow',
'honey ham': 'goat',
'nova lox': 'salmon'
}
meat_to_animal['bacon']

'cow'

In [0]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

##MAP 
<br> map is applied on series mot dataframes
<br> apply map is used on dataframes

In [0]:
a = lambda x : x.upper()
lowercased.map(a)

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [0]:
data['animal'] = lowercased.map(meat_to_animal)   #first takes bacon goes to meat to animal seraches for bacon finds bacon key and returns its value cow to new column animal
 #second takes pulled pork goes to mat to animal searches for pulled pork searches for the keyand returns its value
data

          food  ounces  animal
0        bacon     4.0     cow
1  pulled pork     3.0     cow
2        bacon    12.0     cow
3     Pastrami     6.0    goat
4  corned beef     7.5     cow
5        Bacon     8.0     cow
6     pastrami     3.0    goat
7    honey ham     5.0    goat
8     nova lox     6.0  salmon

In [0]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [0]:
data.replace(-999, np.nan) #(to be replaced, replace to)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [0]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [0]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [0]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data.values                #get values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [0]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [0]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [0]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [0]:
data.rename(index=str.title, columns=str.upper)                        #if the sttaement returns a value it doesnt effect orignal data but if doenst return data it makes changes to orignal data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11